package sirus

import (
	"LazyCatBot/internal/models"
	"fmt"
	"log"
	"slices"
	"strings"
	"time"
)

func GetT4Count(itemset []models.Itemset) int {
	for _, set := range itemset {
		if strings.Contains(set.Name, "Тир 4") {
			return set.Count
		}
	}

	return 0
}

func GetT4CountForLeaderboard(itemset [][]int) int {
	res := 0
	for _, set := range itemset {
		if len(set) == 2 {
			if set[0] >= 1000 && set[0] <= 2000 {
				return set[1]
			}
		}
	}

	return res
}

func GetSpecName(classID, specID int) string {
	specs := map[int]map[int]string{
		1:  {0: "Arms", 1: "Fury", 2: "Prot"},     // Warrior
		2:  {0: "Holy", 1: "Prot", 2: "Retri"},    // Paladin
		3:  {0: "BM", 1: "MM", 2: "Surv"},         // Hunter
		4:  {0: "Assa", 1: "Combat", 2: "Sub"},    // Rogue
		5:  {0: "Disc", 1: "Holy", 2: "Shadow"},   // Priest
		6:  {0: "Blood", 1: "Frost", 2: "Unholy"}, // DK
		7:  {0: "Ele", 1: "Enh", 2: "Resto"},      // Shaman
		8:  {0: "Arcane", 1: "Fire", 2: "Frost"},  // Mage
		9:  {0: "Affli", 1: "Demo", 2: "Destro"},  // Warlock
		11: {0: "Bal", 1: "Feral", 2: "Resto"},    // Druid
	}

	if classSpecs, ok := specs[classID]; ok {
		if name, ok := classSpecs[specID]; ok {
			return name
		}
	}
	return fmt.Sprintf("Spec:%d", specID)
}

func GetSpecs() map[int]map[int]string {
	specs := map[int]map[int]string{
		1:  {0: "Arms", 1: "Fury", 2: "Prot"},     // Warrior
		2:  {0: "Holy", 1: "Prot", 2: "Retri"},    // Paladin
		3:  {0: "BM", 1: "MM", 2: "Surv"},         // Hunter
		4:  {0: "Assa", 1: "Combat", 2: "Sub"},    // Rogue
		5:  {0: "Disc", 1: "Holy", 2: "Shadow"},   // Priest
		6:  {0: "Blood", 1: "Frost", 2: "Unholy"}, // DK
		7:  {0: "Ele", 1: "Enh", 2: "Resto"},      // Shaman
		8:  {0: "Arcane", 1: "Fire", 2: "Frost"},  // Mage
		9:  {0: "Affli", 1: "Demo", 2: "Destro"},  // Warlock
		11: {0: "Bal", 1: "Feral", 2: "Resto"},    // Druid
	}

	return specs
}

func GetRoleString(classID, specID int) string {
	specs := map[int]map[int]string{
		1:  {0: "dps", 1: "dps", 2: "dps"}, // Warrior
		2:  {0: "hps", 1: "dps", 2: "dps"}, // Paladin
		3:  {0: "dps", 1: "dps", 2: "dps"}, // Hunter
		4:  {0: "dps", 1: "dps", 2: "dps"}, // Rogue
		5:  {0: "hps", 1: "hps", 2: "dps"}, // Priest
		6:  {0: "dps", 1: "dps", 2: "dps"}, // DK
		7:  {0: "dps", 1: "dps", 2: "hps"}, // Shaman
		8:  {0: "dps", 1: "dps", 2: "dps"}, // Mage
		9:  {0: "dps", 1: "dps", 2: "dps"}, // Warlock
		11: {0: "dps", 1: "dps", 2: "hps"}, // Druid
	}
	role, ok := specs[classID][specID]
	if !ok {
		return "dps"
	}

	return role
}

func GetZodiacName(fullName string) string {
	return fullName
}

func GetRole(classID, specID int) int {
	healers := map[int][]int{
		2:  {0},    // Paladin (Holy)
		5:  {0, 1}, // Priest (Disc, Holy)
		7:  {2},    // Shaman (Resto)
		10: {1},    // Monk (MW)
		11: {2},    // Druid (Resto)
	}

	if specs, ok := healers[classID]; ok {
		if slices.Contains(specs, specID) {
			return 1
		}
	}
	return 0
}

func GetBossName(raidID, bossID int) string {
	raids := map[int]map[int]string{
		46: {
			0: "Верховный Полководец Надж'ентус",
			1: "Супремус",
			2: "Тень Акамы",
			3: "Терон Кровожад",
			4: "Гуртогг Кипящая Кровь",
			5: "Реликварий Душ",
			6: "Матушка Шахраз",
			7: "Совет Иллидари",
			8: "Иллидан Ярость Бури",
		},
		45: {
			0: "Зорт",
		},
		44: {
			0: "Лютый Хлад",
			1: "Анетерон",
			2: "Каз'рогал",
			3: "Азгалор",
			4: "Архимонд",
		},
		43: {
			0: "Импорус 25 ГЕР",
			1: "Исказитель времени Элонус 25 ГЕР",
			2: "Мурозонд 25 ГЕР",
		},
		42: {
			0: "Импорус 25 ОБ",
			1: "Исказитель времени Элонус 25 ОБ",
			2: "Мурозонд 25 ОБ",
		},
		41: {
			0:  "Огненный Левиафан 25 ГЕР",
			1:  "Повелитель Горнов Игнис 25 ГЕР",
			2:  "Острокрылая 25 ГЕР",
			3:  "Разрушитель XT-002 25 ГЕР",
			4:  "Железное СОБрание 25 ГЕР",
			5:  "Кологарн 25 ГЕР",
			6:  "Ауриайя 25 ГЕР",
			7:  "Ходир 25 ГЕР",
			8:  "Торим 25 ГЕР",
			9:  "Фрейя 25 ГЕР",
			10: "Мимирон 25 ГЕР",
			11: "Генерал Везакс 25 ГЕР",
			12: "Йогг-Сарон 25 ГЕР",
			13: "Алгалон Наблюдатель 25 ГЕР",
		},
		40: {
			0:  "Огненный Левиафан 10 ГЕР",
			1:  "Повелитель Горнов Игнис 10 ГЕР",
			2:  "Острокрылая 10 ГЕР",
			3:  "Разрушитель XT-002 10 ГЕР",
			4:  "Железное СОБрание 10 ГЕР",
			5:  "Кологарн 10 ГЕР",
			6:  "Ауриайя 10 ГЕР",
			7:  "Ходир 10 ГЕР",
			8:  "Торим 10 ГЕР",
			9:  "Фрейя 10 ГЕР",
			10: "Мимирон 10 ГЕР",
			11: "Генерал Везакс 10 ГЕР",
			12: "Йогг-Сарон 10 ГЕР",
			13: "Алгалон Наблюдатель 10 ГЕР",
		},
		39: {
			0: "Гидросс Нестабильный ГЕР",
			1: "Скрытень из глубин ГЕР",
			2: "Леотерас Слепец ГЕР",
			3: "Повелитель глубин Каратресс ГЕР",
			4: "Морогрим Волноступ ГЕР",
			5: "Леди Вайш ГЕР",
		},
		38: {
			0: "Ал'ар ГЕР",
			1: "Страж Бездны ГЕР",
			2: "Верховный звездочет Солариан ГЕР",
			3: "Кель'тас ГЕР",
		},
		37: {
			0: "Гидросс Нестабильный ОБ",
			1: "Скрытень из глубин ОБ",
			2: "Леотерас Слепец ОБ",
			3: "Повелитель глубин Каратресс ОБ",
			4: "Морогрим Волноступ ОБ",
			5: "Леди Вайш ОБ",
		},
		36: {
			0: "Ал'ар ОБ",
			1: "Страж Бездны ОБ",
			2: "Верховный звездочет Солариан ОБ",
			3: "Кель'тас ОБ",
		},
		35: {
			0: "Гогонаш 25",
			1: "Ктракс 25",
			2: "Пожиратель магии 25",
		},
		34: {
			0: "Гогонаш 10",
			1: "Ктракс 10",
			2: "Пожиратель магии 10",
		},
		33: {
			0: "Халион 25 ГЕР",
			1: "Балтар Рожденный в Битве 25 ГЕР",
			2: "Савиана Огненная Пропасть 25 ГЕР",
			3: "Генерал Заритриан 25 ГЕР",
		},
		32: {
			0: "Халион 10 ГЕР",
			1: "Балтар Рожденный в Битве 10 ГЕР",
			2: "Савиана Огненная Пропасть 10 ГЕР",
			3: "Генерал Заритриан 10 ГЕР",
		},
		31: {
			0:  "Лорд Ребро 25 ГЕР",
			1:  "Леди 25 ГЕР",
			2:  "Корабли 25 ГЕР",
			3:  "Сурок Смертоносный 25 ГЕР",
			4:  "Тухлопуз 25 ГЕР",
			5:  "Гниломорд 25 ГЕР",
			6:  "Профессор Мерзоцид 25 ГЕР",
			7:  "Совет 25 ГЕР",
			8:  "Лана'тель 25 ГЕР",
			9:  "Валя 25 ГЕР",
			10: "Синдрагоса 25 ГЕР",
			11: "Король-лич 25 ГЕР",
		},
		30: {
			0:  "Лорд Ребро 10 ГЕР",
			1:  "Леди 10 ГЕР",
			2:  "Корабли 10 ГЕР",
			3:  "Сурок Смертоносный 10 ГЕР",
			4:  "Тухлопуз 10 ГЕР",
			5:  "Гниломорд 10 ГЕР",
			6:  "Профессор Мерзоцид 10 ГЕР",
			7:  "Совет 10 ГЕР",
			8:  "Лана'тель 10 ГЕР",
			9:  "Валя 10 ГЕР",
			10: "Синдрагоса 10 ГЕР",
			11: "Король-лич 10 ГЕР",
		},
		29: {
			0: "Халион 25 ОБ",
			1: "Балтар Рожденный в Битве 25 ОБ",
			2: "Савиана Огненная Пропасть 25 ОБ",
			3: "Генерал Заритриан 25 ОБ",
		},
		28: {
			0: "Халион 10 ОБ",
			1: "Балтар Рожденный в Битве 10 ОБ",
			2: "Савиана Огненная Пропасть 10 ОБ",
			3: "Генерал Заритриан 10 ОБ",
		},
		27: {
			0: "Акил'зон",
			1: "Налоракк",
			2: "Джан'алай",
			3: "Халаззи",
			4: "Малакрасс",
			5: "Зул'джин",
		},
		26: {
			0:  "Лорд Ребро 25 ОБ",
			1:  "Леди 25 ОБ",
			2:  "Корабли 25 ОБ",
			3:  "Сурок Смертоносный 25 ОБ",
			4:  "Тухлопуз 25 ОБ",
			5:  "Гниломорд 25 ОБ",
			6:  "Профессор Мерзоцид 25 ОБ",
			7:  "Совет 25 ОБ",
			8:  "Лана'тель 25 ОБ",
			9:  "Валя 25 ОБ",
			10: "Синдрагоса 25 ОБ",
			11: "Король-лич 25 ОБ",
		},
		25: {
			0:  "Лорд Ребро 10 ОБ",
			1:  "Леди 10 ОБ",
			2:  "Корабли 10 ОБ",
			3:  "Сурок Смертоносный 10 ОБ",
			4:  "Тухлопуз 10 ОБ",
			5:  "Гниломорд 10 ОБ",
			6:  "Профессор Мерзоцид 10 ОБ",
			7:  "Совет 10 ОБ",
			8:  "Лана'тель 10 ОБ",
			9:  "Валя 10 ОБ",
			10: "Синдрагоса 10 ОБ",
			11: "Король-лич 10 ОБ",
		},
		24: {
			0: "Страж камня 25",
			1: "Буря 25",
			2: "Огонь 25",
			3: "Лёд 25",
		},
		23: {
			0: "Камень 10",
			1: "Буря 10",
			2: "Огонь 10",
			3: "Лёд 10",
		},
		22: {
			0: "Короли ГЕР",
			1: "Грууль ГЕР",
		},
		21: {
			0: "Магик ГЕР",
		},
		20: {
			0:  "Ловчий Аттумен ГЕР",
			1:  "Мороуз ГЕР",
			2:  "Благочестивая дева ГЕР",
			3:  "Опера ГЕР",
			4:  "Смотритель ГЕР",
			5:  "Копыто ГЕР",
			6:  "Тень Арана ГЕР",
			7:  "Гнев Пустоты ГЕР",
			8:  "Шахматы ГЕР",
			9:  "Малчезар ГЕР",
			10: "Погибель ГЕР",
		},
		19: {
			0: "Чудовища 25 ГЕР",
			1: "Джараксус 25 ГЕР",
			2: "Чемпы 25 ГЕР",
			3: "Валь'киры 25 ГЕР",
			4: "Ануб'арак 25 ГЕР",
		},
		18: {
			0: "Чудовища 10 ГЕР",
			1: "Джараксус 10 ГЕР",
			2: "Чемпы 10 ГЕР",
			3: "Валь'киры 10 ГЕР",
			4: "Ануб'арак 10 ГЕР",
		},
		17: {
			0: "Короли ОБ",
			1: "Грууль ОБ",
		},
		16: {
			0: "Магтеридон ОБ",
		},
		15: {
			0: "Чудовища 25 ОБ",
			1: "Джараксус 25 ОБ",
			2: "Чемпионы 25 ОБ",
			3: "Валь'киры 25 ОБ",
			4: "Ануб 25 ОБ",
		},
		14: {
			0: "Чудовища 10 ОБ",
			1: "Джараксус 10 ОБ",
			2: "Чемпы 10 ОБ",
			3: "Валь'киры 10 ОБ",
			4: "Ануб'арак 10 ОБ",
		},
		13: {
			0: "Ониксия 25",
		},
		12: {
			0: "Ониксия 10",
		},
		11: {
			0:  "Конь ОБ",
			1:  "Мороуз ОБ",
			2:  "Дева ОБ",
			3:  "Опера ОБ",
			4:  "Смотритель ОБ",
			5:  "Копыто ОБ",
			6:  "Батя Медива ОБ",
			7:  "Гнев Пустоты ОБ",
			8:  "Шашки ОБ",
			9:  "Малчезар ОБ",
			10: "Погибель ОБ",
		},
		10: {
			0:  "Огненный Левиафан 25 ОБ",
			1:  "Повелитель Горнов Игнис 25 ОБ",
			2:  "Острокрылая 25 ОБ",
			3:  "Разрушитель XT-002 25 ОБ",
			4:  "Железное СОБрание 25 ОБ",
			5:  "Кологарн 25 ОБ",
			6:  "Ауриайя 25 ОБ",
			7:  "Ходир 25 ОБ",
			8:  "Торим 25 ОБ",
			9:  "Фрейя 25 ОБ",
			10: "Мимирон 25 ОБ",
			11: "Генерал Везакс 25 ОБ",
			12: "Йогг-Сарон 25 ОБ",
			13: "Алгалон Наблюдатель 25 ОБ",
		},
		9: {
			0:  "Огненный Левиафан 10 ОБ",
			1:  "Повелитель Горнов Игнис 10 ОБ",
			2:  "Острокрылая 10 ОБ",
			3:  "Разрушитель XT-002 10 ОБ",
			4:  "Железное СОБрание10 ОБ",
			5:  "Кологарн10 ОБ",
			6:  "Ауриайя10 ОБ",
			7:  "Ходир 10 ОБ",
			8:  "Торим 10 ОБ",
			9:  "Фрейя 10 ОБ",
			10: "Мимирон 10 ОБ",
			11: "Генерал Везакс 10 ОБ",
			12: "Йогг-Сарон 10 ОБ",
			13: "Алгалон Наблюдатель 10 ОБ",
		},
		8: {
			0:  "Ануб'Рекан 25 ГЕР",
			1:  "Великая вдова Фарлина 25 ГЕР",
			2:  "Мексна 25 ГЕР",
			3:  "Нот Чумной 25 ГЕР",
			4:  "Хейган Нечестивый 25 ГЕР",
			5:  "Лотхиб 25 ГЕР",
			6:  "Инструктор Разувий 25 ГЕР",
			7:  "Готик Жнец 25 ГЕР",
			8:  "Четыре всадника 25 ГЕР",
			9:  "Лоскутик 25 ГЕР",
			10: "ГрОБбулус 25 ГЕР",
			11: "Глут 25 ГЕР",
			12: "Таддиус 25 ГЕР",
			13: "Сапфирон 25 ГЕР",
			14: "Кел'Тузад 25 ГЕР",
		},
		7: {
			0:  "Ануб'Рекан 10 ГЕР",
			1:  "Великая вдова Фарлина 10 ГЕР",
			2:  "Мексна 10 ГЕР",
			3:  "Нот Чумной 10 ГЕР",
			4:  "Хейган Нечестивый 10 ГЕР",
			5:  "Лотхиб 10 ГЕР",
			6:  "Инструктор Разувий 10 ГЕР",
			7:  "Готик Жнец 10 ГЕР",
			8:  "Четыре всадника 10 ГЕР",
			9:  "Лоскутик 10 ГЕР",
			10: "ГрОБбулус",
			11: "Глут 10 ГЕР",
			12: "Таддиус 10 ГЕР",
			13: "Сапфирон 10 ГЕР",
			14: "Кел'Тузад 10 ГЕР",
		},
		6: {
			0: "Малигос 25",
		},
		5: {
			0: "Малигос 10",
		},
		4: {
			0:  "Ануб'Рекан 25 ОБ",
			1:  "Великая вдова Фарлина 25 ОБ",
			2:  "Мексна 25 ОБ",
			3:  "Нот Чумной 25 ОБ",
			4:  "Хейган Нечестивый 25 ОБ",
			5:  "Лотхиб 25 ОБ",
			6:  "Инструктор Разувий 25 ОБ",
			7:  "Готик Жнец 25 ОБ",
			8:  "Четыре всадника 25 ОБ",
			9:  "Лоскутик 25 ОБ",
			10: "ГрОБбулус 25 ОБ",
			11: "Глут 25 ОБ",
			12: "Таддиус 25 ОБ",
			13: "Сапфирон 25 ОБ",
			14: "Кел'Тузад 25 ОБ",
		},
		3: {
			0:  "Ануб'Рекан 10 ОБ",
			1:  "Великая вдова Фарлина 10 ОБ",
			2:  "Мексна 10 ОБ",
			3:  "Нот Чумной 10 ОБ",
			4:  "Хейган Нечестивый 10 ОБ",
			5:  "Лотхиб 10 ОБ",
			6:  "Инструктор Разувий 10 ОБ",
			7:  "Готик Жнец 10 ОБ",
			8:  "Четыре всадника 10 ОБ",
			9:  "Лоскутик 10 ОБ",
			10: "ГрОБбулус 10 ОБ",
			11: "Глут 10 ОБ",
			12: "Таддиус 10 ОБ",
			13: "Сапфирон 10 ОБ",
			14: "Кел'Тузад 10 ОБ",
		},
		2: {
			3: "Сартарион 25",
		},
		1: {
			3: "Сартарион 10",
		},
	}

	return raids[raidID][bossID]
}

func GetMetasirusBossID(raidID, bossID int) int {
	//[raidID][bossID]
	metasirusRaids := map[int]map[int]int{
		24: {
			0: 30,  // страж камня
			1: 49,  //Буря
			2: 22,  //Огонь
			3: 100, //Лёд
		},
		23: {
			0: 30,  //Камень
			1: 49,  //Буря
			2: 22,  //Огонь
			3: 100, //Лёд
		},
		17: {
			0: 13, //Король Молгар
			1: 18, //Груул ДраконОБой
		},
		16: {
			0: 15, //Магтеридон
		},
		15: {
			0: 1, //Чудовища
			1: 4, //Джараксус
			2: 5, //Чемпы
			3: 2, //Валь'киры
			4: 7, //Ануб'арак
		},
		14: {
			0: 1, //Чудовища
			1: 4, //Джараксус
			2: 5, //Чемпы
			3: 2, //Валь'киры
			4: 7, //Ануб'арак
		},
		13: {
			0: 3, //Ониксия
		},
		12: {
			0: 3, //Ониксия
		},
		11: {
			0:  8,  //Ловчий Аттумен
			1:  25, //Мороуз
			2:  24, //Благочестивая дева
			3:  45, //Опера
			4:  10, //Смотритель
			5:  9,  //Терестиан Больное Копыто
			6:  17, //Тень Арана
			7:  16, //Гнев Пустоты
			8:  46, //Шахматы
			9:  19, //Принц Малчезар
			10: 27, //Ночная Погибель
		},
		10: {
			0:  14, //Огненный Левиафан
			1:  28, //Повелитель Горнов Игнис
			2:  32, //Острокрылая
			3:  6,  //Разрушитель XT-002
			4:  21, //Железное СОБрание
			5:  33, //Кологарн
			6:  12, //Ауриайя
			7:  47, //Ходир
			8:  48, //Торим
			9:  52, //Фрейя
			10: 51, //Мимирон
			11: 54, //Генерал Везакс
			12: 53, //Йогг-Сарон
			13: 50, //Алгалон Наблюдатель
		},
		9: {
			0:  14, //Огненный Левиафан
			1:  28, //Повелитель Горнов Игнис
			2:  32, //Острокрылая
			3:  6,  //Разрушитель XT-002
			4:  21, //Железное СОБрание
			5:  33, //Кологарн
			6:  12, //Ауриайя
			7:  47, //Ходир
			8:  48, //Торим
			9:  52, //Фрейя
			10: 51, //Мимирон
			11: 54, //Генерал Везакс
			12: 53, //Йогг-Сарон
			13: 50, //Алгалон Наблюдатель
		},
		8: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //ГрОБбулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		7: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //ГрОБбулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		6: {
			0: 23, //Малигос
		},
		5: {
			0: 23, //Малигос
		},
		4: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //ГрОБбулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		3: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //ГрОБбулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		2: {
			3: 20, //Сартарион
		},
		1: {
			3: 20, //Сартарион
		},
	}

	return metasirusRaids[raidID][bossID]
}

func GetSirusSpecID(metaSirusSpecID int) int {
	sirusSpecIDs := map[int]int{
		17: 0,
		25: 1,
		14: 2,
		1:  0,
		20: 2,
		22: 1,
		15: 0,
		21: 1,
		6:  2,
		29: 2,
		8:  1,
		3:  0,
		30: 2,
		27: 0,
		19: 1,
		10: 2,
		2:  1,
		7:  0,
		13: 1,
		11: 0,
		23: 2,
		18: 0,
		4:  1,
		16: 2,
		24: 1,
		26: 0,
		9:  2,
		5:  2,
		28: 1,
		12: 0,
	}

	return sirusSpecIDs[metaSirusSpecID]
}

func IsPlayerKillToday(dateStr string) bool {
	killTime, err := time.Parse(time.RFC3339, dateStr)
	if err != nil {
		log.Printf("Ошибка парсинга даты: %v", err)
		return false
	}

	loc := time.FixedZone("MSK", 3*3600)
	now := time.Now().In(loc)

	todayStart := time.Date(now.Year(), now.Month(), now.Day(), 0, 0, 0, 0, loc)

	return killTime.After(todayStart)
}

func IsGuildKillToday(dateStr string) bool {
	loc := time.FixedZone("MSK", 3*3600)

	layout := "2006-01-02 15:04:05"

	actionTime, err := time.ParseInLocation(layout, dateStr, loc)
	if err != nil {
		log.Printf("Ошибка парсинга: %v", err)
		return false
	}

	now := time.Now().In(loc)
	todayStart := time.Date(now.Year(), now.Month(), now.Day(), 0, 0, 0, 0, loc)

	return actionTime.After(todayStart)
}

func GetCheckBosses(server int) map[int][]struct {
	Name string
	ID   int
} {
	var raids map[int][]struct {
		Name string
		ID   int
	}

	if server == 0 {
		server = 22
	}

	switch server {
	case 22:
		raids = map[int][]struct {
			Name string
			ID   int
		}{
			19: {
				{Name: "Джараксус ГЕР", ID: 1},
				{Name: "Вальки ГЕР", ID: 3},
			},
			17: {
				{Name: "Груль", ID: 1},
			},
			16: {
				{Name: "Магик", ID: 0},
			},
			11: {
				{Name: "Смотритель", ID: 4},
			},
		}
	default:
		raids = make(map[int][]struct {
			Name string
			ID   int
		})
	}

	return raids
}
