package sirus

import (
	"LazyCatBot/internal/models"
	"fmt"
	"log"
	"strings"
	"time"
)

func GetT4Count(itemset []models.Itemset) int {
	for _, set := range itemset {
		if strings.Contains(set.Name, "Тир 4") {
			return set.Count
		}
	}

	return 0
}

func GetT4CountForLeaderboard(itemset [][]int) int {
	res := 0
	for _, set := range itemset {
		if len(set) == 2 {
			if set[0] >= 1000 && set[0] <= 2000 {
				return set[1]
			}
		}
	}

	return res
}

func GetSpecName(classID, specID int) string {
	specs := map[int]map[int]string{
		1:  {0: "Arms", 1: "Fury", 2: "Prot"},     // Warrior
		2:  {0: "Holy", 1: "Prot", 2: "Retri"},    // Paladin
		3:  {0: "BM", 1: "MM", 2: "Surv"},         // Hunter
		4:  {0: "Assa", 1: "Combat", 2: "Sub"},    // Rogue
		5:  {0: "Disc", 1: "Holy", 2: "Shadow"},   // Priest
		6:  {0: "Blood", 1: "Frost", 2: "Unholy"}, // DK
		7:  {0: "Ele", 1: "Enh", 2: "Resto"},      // Shaman
		8:  {0: "Arcane", 1: "Fire", 2: "Frost"},  // Mage
		9:  {0: "Affli", 1: "Demo", 2: "Destro"},  // Warlock
		11: {0: "Bal", 1: "Feral", 2: "Resto"},    // Druid
	}

	if classSpecs, ok := specs[classID]; ok {
		if name, ok := classSpecs[specID]; ok {
			return name
		}
	}
	return fmt.Sprintf("Spec:%d", specID)
}

func GetSpecs() map[int]map[int]string {
	specs := map[int]map[int]string{
		1:  {0: "Arms", 1: "Fury", 2: "Prot"},     // Warrior
		2:  {0: "Holy", 1: "Prot", 2: "Retri"},    // Paladin
		3:  {0: "BM", 1: "MM", 2: "Surv"},         // Hunter
		4:  {0: "Assa", 1: "Combat", 2: "Sub"},    // Rogue
		5:  {0: "Disc", 1: "Holy", 2: "Shadow"},   // Priest
		6:  {0: "Blood", 1: "Frost", 2: "Unholy"}, // DK
		7:  {0: "Ele", 1: "Enh", 2: "Resto"},      // Shaman
		8:  {0: "Arcane", 1: "Fire", 2: "Frost"},  // Mage
		9:  {0: "Affli", 1: "Demo", 2: "Destro"},  // Warlock
		11: {0: "Bal", 1: "Feral", 2: "Resto"},    // Druid
	}

	return specs
}

func GetRoleString(classID, specID int) string {
	specs := map[int]map[int]string{
		1:  {0: "dps", 1: "dps", 2: "dps"}, // Warrior
		2:  {0: "hps", 1: "dps", 2: "dps"}, // Paladin
		3:  {0: "dps", 1: "dps", 2: "dps"}, // Hunter
		4:  {0: "dps", 1: "dps", 2: "dps"}, // Rogue
		5:  {0: "hps", 1: "hps", 2: "dps"}, // Priest
		6:  {0: "dps", 1: "dps", 2: "dps"}, // DK
		7:  {0: "dps", 1: "dps", 2: "hps"}, // Shaman
		8:  {0: "dps", 1: "dps", 2: "dps"}, // Mage
		9:  {0: "dps", 1: "dps", 2: "dps"}, // Warlock
		11: {0: "dps", 1: "dps", 2: "hps"}, // Druid
	}
	role, ok := specs[classID][specID]
	if !ok {
		return "dps"
	}

	return role
}

func GetZodiacName(fullName string) string {
	return fullName
}

func GetRole(classID, specID int) int {
	healers := map[int][]int{
		2:  {0},    // Paladin (Holy)
		5:  {0, 1}, // Priest (Disc, Holy)
		7:  {2},    // Shaman (Resto)
		10: {1},    // Monk (MW)
		11: {2},    // Druid (Resto)
	}

	if specs, ok := healers[classID]; ok {
		for _, s := range specs {
			if s == specID {
				return 1
			}
		}
	}
	return 0
}

func GetBossName(raidID, bossID int) string {
	raids := map[int]map[int]string{
		24: {
			0: "Страж камня",
			1: "Эмалон Страж Бури",
			2: "Коралон Страж Огня",
			3: "Торавон Страж Льда",
		},
		23: {
			0: "Аркавон Страж Камня",
			1: "Эмалон Страж Бури",
			2: "Коралон Страж Огня",
			3: "Торавон Страж Льда",
		},
		17: {
			0: "Король Молгар",
			1: "Груул Драконобой",
		},
		16: {
			0: "Магтеридон",
		},
		15: {
			0: "Чудовища Нордскола",
			1: "Лорд Джараксус",
			2: "Чемпионы фракций",
			3: "Валь'киры-близнецы",
			4: "Ануб'арак",
		},
		14: {
			0: "Чудовища Нордскола",
			1: "Лорд Джараксус",
			2: "Чемпионы фракций",
			3: "Валь'киры-близнецы",
			4: "Ануб'арак",
		},
		13: {
			0: "Ониксия",
		},
		12: {
			0: "Ониксия",
		},
		11: {
			0:  "Ловчий Аттумен",
			1:  "Мороуз",
			2:  "Благочестивая дева",
			3:  "Опера",
			4:  "Смотритель",
			5:  "Терестиан Больное Копыто",
			6:  "Тень Арана",
			7:  "Гнев Пустоты",
			8:  "Шахматы",
			9:  "Принц Малчезар",
			10: "Ночная Погибель",
		},
		10: {
			0:  "Огненный Левиафан",
			1:  "Повелитель Горнов Игнис",
			2:  "Острокрылая",
			3:  "Разрушитель XT-002",
			4:  "Железное Собрание",
			5:  "Кологарн",
			6:  "Ауриайя",
			7:  "Ходир",
			8:  "Торим",
			9:  "Фрейя",
			10: "Мимирон",
			11: "Генерал Везакс",
			12: "Йогг-Сарон",
			13: "Алгалон Наблюдатель",
		},
		9: {
			0:  "Огненный Левиафан",
			1:  "Повелитель Горнов Игнис",
			2:  "Острокрылая",
			3:  "Разрушитель XT-002",
			4:  "Железное Собрание",
			5:  "Кологарн",
			6:  "Ауриайя",
			7:  "Ходир",
			8:  "Торим",
			9:  "Фрейя",
			10: "Мимирон",
			11: "Генерал Везакс",
			12: "Йогг-Сарон",
			13: "Алгалон Наблюдатель",
		},
		8: {
			0:  "Ануб'Рекан",
			1:  "Великая вдова Фарлина",
			2:  "Мексна",
			3:  "Нот Чумной",
			4:  "Хейган Нечестивый",
			5:  "Лотхиб",
			6:  "Инструктор Разувий",
			7:  "Готик Жнец",
			8:  "Четыре всадника",
			9:  "Лоскутик",
			10: "Гроббулус",
			11: "Глут",
			12: "Таддиус",
			13: "Сапфирон",
			14: "Кел'Тузад",
		},
		7: {
			0:  "Ануб'Рекан",
			1:  "Великая вдова Фарлина",
			2:  "Мексна",
			3:  "Нот Чумной",
			4:  "Хейган Нечестивый",
			5:  "Лотхиб",
			6:  "Инструктор Разувий",
			7:  "Готик Жнец",
			8:  "Четыре всадника",
			9:  "Лоскутик",
			10: "Гроббулус",
			11: "Глут",
			12: "Таддиус",
			13: "Сапфирон",
			14: "Кел'Тузад",
		},
		6: {
			0: "Малигос",
		},
		5: {
			0: "Малигос",
		},
		4: {
			0:  "Ануб'Рекан",
			1:  "Великая вдова Фарлина",
			2:  "Мексна",
			3:  "Нот Чумной",
			4:  "Хейган Нечестивый",
			5:  "Лотхиб",
			6:  "Инструктор Разувий",
			7:  "Готик Жнец",
			8:  "Четыре всадника",
			9:  "Лоскутик",
			10: "Гроббулус",
			11: "Глут",
			12: "Таддиус",
			13: "Сапфирон",
			14: "Кел'Тузад",
		},
		3: {
			0:  "Ануб'Рекан",
			1:  "Великая вдова Фарлина",
			2:  "Мексна",
			3:  "Нот Чумной",
			4:  "Хейган Нечестивый",
			5:  "Лотхиб",
			6:  "Инструктор Разувий",
			7:  "Готик Жнец",
			8:  "Четыре всадника",
			9:  "Лоскутик",
			10: "Гроббулус",
			11: "Глут",
			12: "Таддиус",
			13: "Сапфирон",
			14: "Кел'Тузад",
		},
		2: {
			3: "Сартарион",
		},
		1: {
			3: "Сартарион",
		},
	}

	return raids[raidID][bossID]
}

func GetMetasirusBossID(raidID, bossID int) int {
	//[raidID][bossID]
	metasirusRaids := map[int]map[int]int{
		24: {
			0: 30,  // страж камня
			1: 49,  //Эмалон Страж Бури
			2: 22,  //Коралон Страж Огня
			3: 100, //Торавон Страж Льда
		},
		23: {
			0: 30,  //Аркавон Страж Камня
			1: 49,  //Эмалон Страж Бури
			2: 22,  //Коралон Страж Огня
			3: 100, //Торавон Страж Льда
		},
		17: {
			0: 13, //Король Молгар
			1: 18, //Груул Драконобой
		},
		16: {
			0: 15, //Магтеридон
		},
		15: {
			0: 1, //Чудовища Нордскола
			1: 4, //Лорд Джараксус
			2: 5, //Чемпионы фракций
			3: 2, //Валь'киры-близнецы
			4: 7, //Ануб'арак
		},
		14: {
			0: 1, //Чудовища Нордскола
			1: 4, //Лорд Джараксус
			2: 5, //Чемпионы фракций
			3: 2, //Валь'киры-близнецы
			4: 7, //Ануб'арак
		},
		13: {
			0: 3, //Ониксия
		},
		12: {
			0: 3, //Ониксия
		},
		11: {
			0:  8,  //Ловчий Аттумен
			1:  25, //Мороуз
			2:  24, //Благочестивая дева
			3:  45, //Опера
			4:  10, //Смотритель
			5:  9,  //Терестиан Больное Копыто
			6:  17, //Тень Арана
			7:  16, //Гнев Пустоты
			8:  46, //Шахматы
			9:  19, //Принц Малчезар
			10: 27, //Ночная Погибель
		},
		10: {
			0:  14, //Огненный Левиафан
			1:  28, //Повелитель Горнов Игнис
			2:  32, //Острокрылая
			3:  6,  //Разрушитель XT-002
			4:  21, //Железное Собрание
			5:  33, //Кологарн
			6:  12, //Ауриайя
			7:  47, //Ходир
			8:  48, //Торим
			9:  52, //Фрейя
			10: 51, //Мимирон
			11: 54, //Генерал Везакс
			12: 53, //Йогг-Сарон
			13: 50, //Алгалон Наблюдатель
		},
		9: {
			0:  14, //Огненный Левиафан
			1:  28, //Повелитель Горнов Игнис
			2:  32, //Острокрылая
			3:  6,  //Разрушитель XT-002
			4:  21, //Железное Собрание
			5:  33, //Кологарн
			6:  12, //Ауриайя
			7:  47, //Ходир
			8:  48, //Торим
			9:  52, //Фрейя
			10: 51, //Мимирон
			11: 54, //Генерал Везакс
			12: 53, //Йогг-Сарон
			13: 50, //Алгалон Наблюдатель
		},
		8: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //Гроббулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		7: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //Гроббулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		6: {
			0: 23, //Малигос
		},
		5: {
			0: 23, //Малигос
		},
		4: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //Гроббулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		3: {
			0:  26, //Ануб'Рекан
			1:  34, //Великая вдова Фарлина
			2:  35, //Мексна
			3:  39, //Нот Чумной
			4:  40, //Хейган Нечестивый
			5:  29, //Лотхиб
			6:  36, //Инструктор Разувий
			7:  37, //Готик Жнец
			8:  38, //Четыре всадника
			9:  41, //Лоскутик
			10: 42, //Гроббулус
			11: 43, //Глут
			12: 44, //Таддиус
			13: 31, //Сапфирон
			14: 11, //Кел'Тузад
		},
		2: {
			3: 20, //Сартарион
		},
		1: {
			3: 20, //Сартарион
		},
	}

	return metasirusRaids[raidID][bossID]
}

func GetSirusSpecID(metaSirusSpecID int) int {
	sirusSpecIDs := map[int]int{
		17: 0,
		25: 1,
		14: 2,
		1:  0,
		20: 2,
		22: 1,
		15: 0,
		21: 1,
		6:  2,
		29: 2,
		8:  1,
		3:  0,
		30: 2,
		27: 0,
		19: 1,
		10: 2,
		2:  1,
		7:  0,
		13: 1,
		11: 0,
		23: 2,
		18: 0,
		4:  1,
		16: 2,
		24: 1,
		26: 0,
		9:  2,
		5:  2,
		28: 1,
		12: 0,
	}

	return sirusSpecIDs[metaSirusSpecID]
}

func IsPlayerKillToday(dateStr string) bool {
	killTime, err := time.Parse(time.RFC3339, dateStr)
	if err != nil {
		log.Printf("Ошибка парсинга даты: %v", err)
		return false
	}

	loc := time.FixedZone("MSK", 3*3600)
	now := time.Now().In(loc)

	todayStart := time.Date(now.Year(), now.Month(), now.Day(), 0, 0, 0, 0, loc)

	return killTime.After(todayStart)
}

func IsGuildKillToday(dateStr string) bool {
	loc := time.FixedZone("MSK", 3*3600)

	layout := "2006-01-02 15:04:05"

	actionTime, err := time.ParseInLocation(layout, dateStr, loc)
	if err != nil {
		log.Printf("Ошибка парсинга: %v", err)
		return false
	}

	now := time.Now().In(loc)
	todayStart := time.Date(now.Year(), now.Month(), now.Day(), 0, 0, 0, 0, loc)

	return actionTime.After(todayStart)
}

func GetCheckBosses(server int) map[int][]struct {
	Name string
	ID   int
} {
	var raids map[int][]struct {
		Name string
		ID   int
	}

	if server == 0 {
		server = 22
	}

	switch server {
	case 22:
		raids = map[int][]struct {
			Name string
			ID   int
		}{
			15: {
				{Name: "Джараксус", ID: 1},
				{Name: "Вальки", ID: 3},
			},
			17: {
				{Name: "Груль", ID: 1},
			},
			16: {
				{Name: "Магик", ID: 0},
			},
		}
	default:
		raids = make(map[int][]struct {
			Name string
			ID   int
		})
	}

	return raids
}
